Q_Buff_index={["q_buff_id"]=1,
["q_comment"]=2,
["q_buff_name"]=3,
["q_buff_overlap_max"]=4,
["q_buff_duration_time"]=5,
["q_buff_var"]=6,
["q_buff_type"]=7,
["q_customtype"]=8,
["q_customlevel"]=9,
["q_buffreplace"]=10,
["q_skillbuffdata"]=11,
["q_buff_effect_id"]=12,
["q_buff_duration_sound"]=13,
}

Q_Buff={[100]={100,"","",1,"5.0","0.0",0,0,0,"",0,"0.0","0.0"},
[7000]={7000,"收缩，方寸血肉在用","收缩",1,"6.0","0.5",1,1,1,"7000.0",0,"1_12072_0.5_0.5","0.0"},
[7001]={7001,"加速，灵魂效率在用","加速",1,"5.0","0.0",4,2,2,"0.0",21000,"1_12005_0.5_0.5","0.0"},
[7002]={7002,"减速，进气口打击弹在用","减速",1,"10.0","0.0",4,3,2,"0.0",21005,"0.0","0.0"},
[7003]={7003,"持续掉血","掉血",1,"10.0","0.0",4,4,1,"0.0",20002,"0.0","0.0"},
[7004]={7004,"无法控制，邪祖闪电,北神雷锤在用","瘫痪",1,"1.7","0.0",2,5,1,"0.0",0,"1_12056_0.5_0.5","0.0"},
[7005]={7005,"方向颠倒，倒行逆施在用","混乱",1,"2.7","0.0",3,6,1,"0.0",0,"1_12016_0.5_0.5","0.0"},
[7006]={7006,"增加射程(后羿射日在用）","射程上升",1,"20.0","0.0",4,7,1,"0.0",21002,"1_12008_0.5_0.5","0.0"},
[7007]={7007,"防护罩","护盾",1,"8.0","0.0",7,8,2,"0.0",0,"1_12064_0.5_0.5","0.0"},
[7008]={7008,"急速一万在用，增加攻击","弹速上升",1,"4.0","0.0",4,9,1,"0.0",21003,"1_12075_0.5_0.5","0.0"},
[7009]={7009,"隐形，色素进化在用","隐身",1,"5.0","0.7",5,10,2,"0.0",0,"0.0","0.0"},
[7010]={7010,"辉耀，黑域放射在用","辐射",1,"4.0","0.0",6,11,1,"0.0",21001,"2_12027_0.5_0.5","0.0"},
[7011]={7011,"减少装填时间(空降群鹫在用）","装填时间",1,"4.0","0.0",4,7,1,"0.0",21004,"1_12008_0.5_0.5","0.0"},
[7012]={7012,"去除buff用","清洗",1,"1.0","0.0",4,12,1,"7002_7003_7004_7005",0,"0.0","0.0"},
[7013]={7013,"加速，润滑油在用","加速",1,"10.0","0.0",4,2,1,"0.0",20001,"1_12005_0.5_0.5","0.0"},
[7014]={7014,"隐形，光学欺骗在用","隐身",1,"5.0","0.7",5,10,1,"0.0",0,"0.0","0.0"},
[7015]={7015,"减速粉尘道具在用","减速",1,"1.0","0.0",4,3,1,"0.0",21005,"0.0","0.0"},
[7016]={7016,"防护罩道具在用","护盾",1,"2.0","0.0",7,8,1,"0.0",0,"1_12064_0.5_0.5","0.0"},
[7017]={7017,"增加防御力","防御",1,"5.0","0.0",4,10,1,"0.0",0,"0.0","0.0"},
}
Q_Buff.GetTempData = function (key, strName)
                             if not Q_Buff[key] or not Q_Buff_index[strName] or type(key) == "function" then
                                    log_info("Q_Buff.log"," the data is nil or the index data is nil or key is function key =%s , strName = %s" , tostring(key) , tostring( strName))
                                    return nil
                             end
                             if type(Q_Buff[key]) ~= "table" then
                                    log_info("Q_Buff.log"," the data is not table key =%s , strName = %s" , tostring(key) , tostring( strName))
                                return nil
                             end
                             local pData = Q_Buff[key][Q_Buff_index[strName]]
                             if not pData then
                                 log_info("Q_Buff.log"," the data is nil key =%s , strName = %s" , tostring(key) , tostring( strName))
                                 return nil
                             end
                             return pData
                         end
