Q_FacadeTank_index={["q_id"]=1,
["q_comments"]=2,
["q_res_body_id"]=3,
["q_res_battery_id"]=4,
["q_tank_effect_id"]=5,
["q_skin_describ"]=6,
["q_skin_icon_id"]=7,
["q_skin_buy_"]=8,
}

Q_FacadeTank={[600]={600,"黑眼侦查",10600,10601,"","","100.png",""},
[602]={602,"蝠翼侦察",10602,10603,"","","102.png",""},
[610]={610,"血祭突击",10610,10611,"","","110.png",""},
[611]={611,"血祭-银耀",11610,11611,"12152_12151","银耀一出，无与伦比！","111.png","30001_1002"},
[612]={612,"颅灭突击",10612,10613,"","","112.png",""},
[620]={620,"暗夜行者主战",10620,10621,"","","120.png",""},
[621]={621,"暗夜行者—银耀",11912,11913,"12132_12131","暗夜之光，谁与争锋！","121.png","30001_1002"},
[622]={622,"神骨主战",10622,10623,"","","122.png",""},
[700]={700,"魑魅侦查",10700,10701,"","","200.png",""},
[701]={701,"魑魅-银耀",11700,11701,"12136_12135","行踪诡异，神龙见首不见尾！","201.png","30001_1002"},
[702]={702,"谛听侦察",10702,10703,"","","202.png",""},
[710]={710,"合金夸父突击",10710,10711,"","","210.png",""},
[711]={711,"合金夸父-银耀",11710,11711,"12138_12137","追逐天下，一日千里！","211.png","30001_1002"},
[712]={712,"鬼相柳突击",10712,10713,"","","212.png",""},
[720]={720,"业火主战",10720,10721,"","","220.png",""},
[721]={721,"业火-银耀",11720,11721,"12154_12153","赤炎突袭，天下为先！","221.png","30001_1002"},
[722]={722,"龙皇主战",10722,10723,"","","222.png",""},
[800]={800,"郊狼侦查",10800,10801,"","","300.png",""},
[802]={802,"海雕侦察",10802,10803,"","","302.png",""},
[810]={810,"恐怖走鹫突击",10810,10811,"","","310.png",""},
[812]={812,"疯狂火鸡突击",10812,10813,"","","312.png",""},
[820]={820,"黑色犀牛主战",10820,10821,"","","320.png",""},
[822]={822,"北美蛮牛主战",10822,10823,"","","322.png",""},
[900]={900,"极夜尖兵侦查",10900,10901,"","","400.png",""},
[901]={901,"极夜尖兵-银耀",11900,11901,"12146_12145","深夜潜伏，杀敌无形！","401.png","30001_1002"},
[902]={902,"英雄侦察",10902,10903,"","","402.png",""},
[910]={910,"北极光突击",10910,10911,"","","410.png",""},
[911]={911,"北极光-银耀",11910,11911,"12134_12133","冰火九天，上下无踪！","411.png","30001_1002"},
[912]={912,"突出部突击",10912,10913,"","","412.png",""},
[920]={920,"陆王主战",10920,10921,"","","420.png",""},
[922]={922,"赤卫者主战",10922,10923,"","","422.png",""},
}
Q_FacadeTank.GetTempData = function (key, strName)
                             if not Q_FacadeTank[key] or not Q_FacadeTank_index[strName] or type(key) == "function" then
                                    log_info("Q_FacadeTank.log"," the data is nil or the index data is nil or key is function key =%s , strName = %s" , tostring(key) , tostring( strName))
                                    return nil
                             end
                             if type(Q_FacadeTank[key]) ~= "table" then
                                    log_info("Q_FacadeTank.log"," the data is not table key =%s , strName = %s" , tostring(key) , tostring( strName))
                                return nil
                             end
                             local pData = Q_FacadeTank[key][Q_FacadeTank_index[strName]]
                             if not pData then
                                 log_info("Q_FacadeTank.log"," the data is nil key =%s , strName = %s" , tostring(key) , tostring( strName))
                                 return nil
                             end
                             return pData
                         end
