Q_Res_index={["q_id"]=1,
["q_comments"]=2,
["q_path"]=3,
["q_name"]=4,
}

Q_Res={[10600]={10600,"黑眼侦查底盘","","10600.png"},
[10601]={10601,"黑眼侦查炮塔","","10601.png"},
[10602]={10602,"蝠翼侦察底盘","","10602.png"},
[10603]={10603,"蝠翼侦察炮塔","","10603.png"},
[10610]={10610,"血祭突击底盘","","10610.png"},
[10611]={10611,"血祭突击炮塔","","10611.png"},
[10612]={10612,"颅灭突击底盘","","10612.png"},
[10613]={10613,"颅灭突击炮塔","","10613.png"},
[10620]={10620,"暗夜行者主战底盘","","10620.png"},
[10621]={10621,"暗夜行者主战炮塔","","10621.png"},
[10622]={10622,"神骨主战底盘","","10622.png"},
[10623]={10623,"神骨主战炮塔","","10623.png"},
[10700]={10700,"魑魅侦查底盘","","10700.png"},
[10701]={10701,"魑魅侦查炮塔","","10701.png"},
[10702]={10702,"谛听侦察底盘","","10702.png"},
[10703]={10703,"谛听侦察炮塔","","10703.png"},
[10710]={10710,"合金夸父突击底盘","","10710.png"},
[10711]={10711,"合金夸父突击炮塔","","10711.png"},
[10712]={10712,"鬼相柳突击底盘","","10712.png"},
[10713]={10713,"鬼相柳突击炮塔","","10713.png"},
[10720]={10720,"业火主战底盘","","10720.png"},
[10721]={10721,"业火主战炮塔","","10721.png"},
[10722]={10722,"龙皇主战底盘","","10722.png"},
[10723]={10723,"龙皇主战炮塔","","10723.png"},
[10800]={10800,"郊狼侦查底盘","","10800.png"},
[10801]={10801,"郊狼侦查炮塔","","10801.png"},
[10802]={10802,"海雕侦察底盘","","10802.png"},
[10803]={10803,"海雕侦察炮塔","","10803.png"},
[10810]={10810,"恐怖走鹫突击底盘","","10810.png"},
[10811]={10811,"恐怖走鹫突击炮塔","","10811.png"},
[10812]={10812,"疯狂火鸡突击底盘","","10812.png"},
[10813]={10813,"疯狂火鸡突击炮塔","","10813.png"},
[10820]={10820,"黑色犀牛主战底盘","","10820.png"},
[10821]={10821,"黑色犀牛主战炮塔","","10821.png"},
[10822]={10822,"北美蛮牛主战底盘","","10822.png"},
[10823]={10823,"北美蛮牛主战炮塔","","10823.png"},
[10900]={10900,"极夜尖兵侦查底盘","","10900.png"},
[10901]={10901,"极夜尖兵侦查炮塔","","10901.png"},
[10902]={10902,"英雄侦察底盘","","10902.png"},
[10903]={10903,"英雄侦察炮塔","","10903.png"},
[10910]={10910,"北极光突击底盘","","10910.png"},
[10911]={10911,"北极光突击炮塔","","10911.png"},
[10912]={10912,"突出部突击底盘","","10912.png"},
[10913]={10913,"突出部突击炮塔","","10913.png"},
[10920]={10920,"陆王主战底盘","","10920.png"},
[10921]={10921,"陆王主战炮塔","","10921.png"},
[10922]={10922,"赤卫者主战底盘","","10922.png"},
[10923]={10923,"赤卫者主战炮塔","","10923.png"},
[11610]={11610,"血祭-银耀底盘","","11610.png"},
[11611]={11611,"血祭-银耀炮塔","","11611.png"},
[11700]={11700,"魑魅-银耀底盘","","11610.png"},
[11701]={11701,"魑魅-银耀炮塔","","11611.png"},
[11710]={11710,"合金夸父-银耀底盘","","11710.png"},
[11711]={11711,"合金夸父-银耀炮塔","","11711.png"},
[11720]={11720,"业火-银耀炮塔","","11720.png"},
[11721]={11721,"业火-银耀底盘","","11721.png"},
[11900]={11900,"极夜尖兵-银耀底盘","","11900.png"},
[11901]={11901,"极夜尖兵-银耀炮塔","","11901.png"},
[11910]={11910,"北极光-银耀底盘","","11910.png"},
[11911]={11911,"北极光-银耀炮塔","","11911.png"},
[11912]={11912,"暗夜行者—银耀底盘","","11912.png"},
[11913]={11913,"暗夜行者—银耀炮塔","","11913.png"},
[20000]={20000,"战队图标","","team_default_icon.png"},
[20001]={20001,"战队图标","","team_default_icon.png"},
[20002]={20002,"战队图标","","team_default_icon.png"},
[20003]={20003,"战队图标","","team_default_icon.png"},
[20004]={20004,"战队图标","","team_default_icon.png"},
[20005]={20005,"战队图标","","team_default_icon.png"},
}
Q_Res.GetTempData = function (key, strName)
                             if not Q_Res[key] or not Q_Res_index[strName] or type(key) == "function" then
                                    log_info("Q_Res.log"," the data is nil or the index data is nil or key is function key =%s , strName = %s" , tostring(key) , tostring( strName))
                                    return nil
                             end
                             if type(Q_Res[key]) ~= "table" then
                                    log_info("Q_Res.log"," the data is not table key =%s , strName = %s" , tostring(key) , tostring( strName))
                                return nil
                             end
                             local pData = Q_Res[key][Q_Res_index[strName]]
                             if not pData then
                                 log_info("Q_Res.log"," the data is nil key =%s , strName = %s" , tostring(key) , tostring( strName))
                                 return nil
                             end
                             return pData
                         end
