q_global_index={["Id"]=1,
["GDDesc"]=2,
["IntValue"]=3,
["StringValue"]=4,
}

q_global={[1]={1,"给玩家考虑的时间",180,""},
[2]={2,"延迟开始游戏的时间（开始检查的延迟）",6,""},
[3]={3,"执行动作的延迟",2,""},
[4]={4,"开一张牌的延迟",2,""},
[5]={5,"房间等待的最大时间",120,""},
[6]={6,"红大碰",9,""},
[7]={7,"红小碰",6,""},
[8]={8,"红大坎",12,""},
[9]={9,"红小坎",9,""},
[10]={10,"红大拢",18,""},
[11]={11,"红小龙",15,""},
[12]={12,"红大招",15,""},
[13]={13,"红小招",12,""},
[14]={14,"黑大碰",3,""},
[15]={15,"黑小碰",1,""},
[16]={16,"黑大坎",9,""},
[17]={17,"黑小坎",6,""},
[18]={18,"黑大拢",15,""},
[19]={19,"黑小拢",12,""},
[20]={20,"黑大招",12,""},
[21]={21,"黑小招",9,""},
[22]={22,"大二七十",9,""},
[23]={23,"小二七十",6,""},
[24]={24,"大一二三",6,""},
[25]={25,"小一二三",3,""},
[26]={26,"乱胡",1,""},
[27]={27,"地胡",1,""},
[28]={28,"报牌",1,""},
[29]={29,"水上漂",1,""},
[30]={30,"海底捞",1,""},
[31]={31,"坤",1,""},
[32]={32,"红牌",1,""},
[33]={33,"黑牌",3,""},
[34]={34,"查叫",1,""},
[35]={35,"炸天报",3,""},
[36]={36,"杀报",1,""},
[37]={37,"归",1,""},
[38]={38,"自摸",1,""},
[39]={39,"点炮",1,""},
[40]={40,"大贰房间的最大游戏进行时间",1200,""},
[41]={41,"存钱最小数量",20000,""},
[42]={42,"玩家发送喇叭间隔（单位：秒）",10,""},
[43]={43,"玩家发送喇叭显示次数",5,""},
[44]={44,"发送喇叭的消耗（金币）",1000,""},
[45]={45,"签到金币奖励",1000,""},
[46]={46,"连续签到7天奖励（金币）",1000,""},
[47]={47,"连续签到15天奖励（金币）",2000,""},
[48]={48,"连续签到21天奖励（金币）",3000,""},
[49]={49,"连续签到满月（金币）",10000,""},
[10000]={10000,"房间名字屏蔽关键字，枪支，毛主席",0,""},
[100]={100,"大贰固定语言id范围",0,"1_8"},
[101]={101,"麻将固定语言id范围",0,"100_199"},
[102]={102,"德州固定语言id范围",0,"200_299"},
[103]={103,"普通表情 id范围",0,"4001_4015"},
[104]={104,"VIP表情 id范围",0,"5001_5006"},
}
q_global.GetTempData = function (key, strName)
                             if not q_global[key] or not q_global_index[strName] or type(key) == "function" then
                                    log_info("q_global.log"," the data is nil or the index data is nil or key is function key =%s , strName = %s" , tostring(key) , tostring( strName))
                                    return nil
                             end
                             if type(q_global[key]) ~= "table" then
                                    log_info("q_global.log"," the data is not table key =%s , strName = %s" , tostring(key) , tostring( strName))
                                return nil
                             end
                             local pData = q_global[key][q_global_index[strName]]
                             if not pData then
                                 log_info("q_global.log"," the data is nil key =%s , strName = %s" , tostring(key) , tostring( strName))
                                 return nil
                             end
                             return pData
                         end
